#Дано: текст любой длины.
text = 'hello world'
#Задание: написать программу, которая выведет заголовок, используя заданный текст. Подсказка используйте метод title.

#Пример: text = 'hello world'; результат = Hello World

print(text.title())